app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Class A"], ["room_number", 100]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Programing"], ["room_number", 2], ["id", 2]]